
       // (c) 2019 John Erps
       // This software is licensed under the MIT license (see LICENSE)


      /IF DEFINED(CSYSSQLS_INCL_API)
      /EOF
      /ENDIF
      /DEFINE CSYSSQLS_INCL_API


       // INCLUDE: *SRVPGM CSYSSQLS

       // API


       // SEE INCL_RM FOR IMPORTANT INFORMATION !!!


      /include CSYSSQLSS,INCL_DEFS
      /include CSYSSQLSS,INCL_SS
      /include CSYSSQLSS,INCL_CI
      /include CSYSSQLSS,INCL_RM

