
       // (c) 2019 John Erps
       // This software is licensed under the MIT license (see LICENSE)


       // Module Header specs for *SRVPGM CAPPDISP

       // NOTE:
       // Include prerequisite service program definitions in INCL_DEFS.


     h copyright('(c) 2019 John Erps')

     h bnddir(
     h             'CAPPBASE'
     h            :'CSYSSQLS'
     h            :'CSYSBASE'
     h       )

     h nomain decedit(*JOBRUN)

